'use strict';

// 1) Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// const a = prompt('Введите число');
// if (+a > 0 && +a < 5 ){
//   console.log('Верно')
// } else {
//   console.log('Не верно')
// }

// 2) Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и
// меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// const a = prompt('Введите число для переменной A');
// const b = prompt('Введите число для переменной B');
// if ((a > 2 && a < 11) || (b >= 6 && b < 14)){
//     console.log('Верно')
// }else console.log('Неверно');

// 3) Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите
// в консоль сумму этих переменных (a+b), иначе выведите их разность (a-b).
// const a = +prompt('Введите число для переменной А');
// const b = +prompt('Введите число для переменной В');
// if ((a <= 1) && (b >= 3 )){
//     console.log(a+b)
// }else {
//     console.log(a-b)
// }

// 4)Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1',
// то в переменную result запишем 'зима', если имеет значение '2' – 'весна', 3 - 'лето', 4- 'осень'.
// Решите задачу через switch-case и if-else.
// const num = +prompt('Введите числа от 1 до 4');
// const result = num;
// switch (result) {
//     case 1:console.log('Зима');break;
//     case 2:console.log('Весна');break;
//     case 3:console.log('Лето');break;
//     case 4:console.log('Осень');break;
// }